/*
 *  3 питання з відповідями в JavaScript
 */

let counter = 0;

let ans1 = prompt("Навколо якої зірки обертається Земля?") ?? "";
if (ans1.toLowerCase() === "солнце") {
    alert ("Правильна відповідь");
    ++counter;
} else {
    alert ("Відповідь неправильна");
}

let ans2 = prompt("Яка планета найбільна у сонячній системі?") ?? "";
if (ans2.toLowerCase() === "юпітер") {
    alert ("Правильна відповідь");
     ++counter;
} else {
    alert ("Відповідь неправильна");
}

let ans3 = prompt("Яка планета найменша планета у сонячній системі?") ?? "";
if (ans3.toLowerCase() === "меркурій") {
    alert ("Правильна відповідь");
     ++counter;
} else {
    alert ("Відповідь неправильна");
}

alert("Правильних відповідей: " + counter);
